zephyrproject-rtos/zephyr/drivers/entropy/entropy_stm32.c
/*
 * Copyright (c) 2017 Erwin Rol <erwin@erwinrol.com>
 * Copyright (c) 2018 Nordic Semiconductor ASA
 * Copyright (c) 2017 Exati Tecnologia Ltda.
 * Copyright (c) 2020 STMicroelectronics.
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#include <errno.h>
#include <stddef.h>

#include <soc.h>
#include <stm32_bitops.h>
#include <stm32_hsem.h>
#include <stm32_ll_bus.h>
#include <stm32_ll_pka.h>
#include <stm32_ll_rcc.h>
#include <stm32_ll_rng.h>
#include <stm32_ll_system.h>

#include <zephyr/device.h>
#include <zephyr/drivers/clock_control.h>
#include <zephyr/drivers/clock_control/stm32_clock_control.h>
#include <zephyr/drivers/entropy.h>
#include <zephyr/init.h>
#include <zephyr/irq.h>
#include <zephyr/kernel.h>
#include <zephyr/pm/device.h>
#include <zephyr/pm/policy.h>
#include <zephyr/random/random.h>
#include <zephyr/sys/__assert.h>
#include <zephyr/sys/atomic.h>
#include <zephyr/sys/barrier.h>
#include <zephyr/sys/printk.h>
#include <zephyr/sys/util.h>

#include "entropy_stm32.h"

#include <zephyr/logging/log.h>
LOG_MODULE_REGISTER(entropy_stm32, CONFIG_ENTROPY_LOG_LEVEL);

#if defined(RNG_CR_CONDRST)
#define STM32_CONDRST_SUPPORT
#endif

/*
 * This driver need to take into account all STM32 family:
 *  - simple rng without hardware fifo and no DMA.
 *  - Variable delay between two consecutive random numbers
 *    (depending on family and clock settings)
 *  - IRQ-less TRNG instances
 *
 * Due to the first byte in a stream of bytes being more costly on
 * some platforms a "water system" inspired algorithm is used to
 * amortize the cost of the first byte.
 *
 * The algorithm will delay generation of entropy until the amount of
 * bytes goes below THRESHOLD, at which point it will generate entropy
 * until the BUF_LEN limit is reached.
 *
 * The entropy level is checked at the end of every consumption of
 * entropy.
 *
 * For TRNG instances with no IRQ, a delayable work item is scheduled
 * on the system work queue and used to "simulate" device-generated
 * interrupts - this is done to reduce polling to a minimum.
 */

struct rng_pool {
	uint8_t first_alloc;
	uint8_t first_read;
	uint8_t last;
	uint8_t mask;
	uint8_t threshold;
	FLEXIBLE_ARRAY_DECLARE(uint8_t, buffer);
};

#define RNG_POOL_DEFINE(name, len) uint8_t name[sizeof(struct rng_pool) + (len)]

BUILD_ASSERT((CONFIG_ENTROPY_STM32_ISR_POOL_SIZE &
	      (CONFIG_ENTROPY_STM32_ISR_POOL_SIZE - 1)) == 0,
	     "The CONFIG_ENTROPY_STM32_ISR_POOL_SIZE must be a power of 2!");

BUILD_ASSERT((CONFIG_ENTROPY_STM32_THR_POOL_SIZE &
	      (CONFIG_ENTROPY_STM32_THR_POOL_SIZE - 1)) == 0,
	     "The CONFIG_ENTROPY_STM32_THR_POOL_SIZE must be a power of 2!");

/**
 * RM0505 §14.4 "TRNG functional description":
 *  To use the TRNG peripheral the system clock frequency must be
 *  at least 32 MHz. See also: §6.2.2 "Peripheral clock details".
 */
BUILD_ASSERT(!IS_ENABLED(CONFIG_SOC_STM32WB09XX) ||
		STM32_HCLK_FREQUENCY >= (32 * 1000 * 1000),
	"STM32WB09: TRNG requires system clock frequency >= 32MHz");

struct entropy_stm32_rng_dev_cfg {
	RNG_TypeDef *rng;
	const struct device *clock;
	struct stm32_pclken *pclken;
};

struct entropy_stm32_rng_dev_data {
	struct k_sem sem_lock;
	struct k_sem sem_sync;
	struct k_work filling_work;
#if IRQLESS_TRNG
	/* work item that polls TRNG to refill pools */
	struct k_work_delayable trng_poll_work;
#endif /* IRQLESS_TRNG */
	struct k_work_q *filling_wq;
	atomic_t filling_pools;		/* 1 when pools filling is in progress, 0 otherwise */
	atomic_t pm_locked;		/* 1 when PM is locked for pool refill, 0 otherwise */

	/*
	 * Keeps track of how many times the RNG has been enabled.
	 * When non-zero, the RNG HSEM should be held if applicable.
	 * Notably used in get_entropy_isr() to implement re-entrancy.
	 * This field is protected by uc_lock which must be a spinlock
	 * to prevent races with ISRs; a mere atomic_t is not sufficient.
	 */
	uint32_t use_count;
	struct k_spinlock uc_lock;

	RNG_POOL_DEFINE(isr, CONFIG_ENTROPY_STM32_ISR_POOL_SIZE);
	RNG_POOL_DEFINE(thr, CONFIG_ENTROPY_STM32_THR_POOL_SIZE);
};

#define TRNG_BASE ((RNG_TypeDef *)DT_INST_REG_ADDR(0))

#ifdef CONFIG_ENTROPY_STM32_WORKQUEUE
static K_THREAD_STACK_DEFINE(entropy_stm32_wq_stack, CONFIG_ENTROPY_STM32_WQ_STACK_SIZE);
static struct k_work_q entropy_stm32_wq;
#endif

static struct stm32_pclken pclken_rng[] = STM32_DT_INST_CLOCKS(0);

static struct entropy_stm32_rng_dev_cfg entropy_stm32_rng_config = {
	.rng = TRNG_BASE,
	.clock = DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE),
	.pclken	= pclken_rng
};

static struct entropy_stm32_rng_dev_data entropy_stm32_rng_data;

#if defined(CONFIG_SOC_SERIES_STM32WBX) || defined(CONFIG_STM32H7_DUAL_CORE)
#define HAS_MULTICORE_SHARED_RNG 1
#else /* CONFIG_SOC_SERIES_STM32WBX || CONFIG_STM32H7_DUAL_CORE */
#define HAS_MULTICORE_SHARED_RNG 0
#endif /* CONFIG_SOC_SERIES_STM32WBX || CONFIG_STM32H7_DUAL_CORE */

static void entropy_stm32_hsem_acquire(void)
{
	z_stm32_hsem_lock(CFG_HW_RNG_SEMID, HSEM_LOCK_WAIT_FOREVER);
}

static int entropy_stm32_hsem_try_acquire(void)
{
	return z_stm32_hsem_try_lock(CFG_HW_RNG_SEMID);
}

static void entropy_stm32_hsem_release(void)
{
	z_stm32_hsem_unlock(CFG_HW_RNG_SEMID);
}

/* Note API quirk: on uniprocessor, this returns false! */
__maybe_unused
static bool entropy_stm32_hsem_is_owned(void)
{
	return z_stm32_hsem_is_owned(CFG_HW_RNG_SEMID);
}

#define ASSERT_RNG_HSEM_OWNED() \
	__ASSERT_NO_MSG(!HAS_MULTICORE_SHARED_RNG || entropy_stm32_hsem_is_owned())
#define ASSERT_RNG_HSEM_NOT_OWNED() \
	__ASSERT_NO_MSG(!HAS_MULTICORE_SHARED_RNG || !entropy_stm32_hsem_is_owned())

static void configure_rng(void)
{
	__maybe_unused RNG_TypeDef *rng = TRNG_BASE;

#ifdef STM32_CONDRST_SUPPORT
	uint32_t desired_nist_cfg = DT_INST_PROP_OR(0, nist_config, 0U);
	uint32_t desired_htcr = DT_INST_PROP_OR(0, health_test_config, 0U);
	uint32_t desired_nscr = DT_INST_PROP_OR(0, noise_source_control, 0U);
	uint32_t cur_nist_cfg = 0U;
	uint32_t cur_htcr = 0U;
	uint32_t cur_nscr = 0U;

#if DT_INST_NODE_HAS_PROP(0, nist_config)
	/*
	 * Configure the RNG_CR in compliance with the NIST SP800.
	 * The nist-config is directly copied from the DTS.
	 * The RNG clock must be 48MHz else the clock DIV is not adapted.
	 * The RNG_CR_CONDRST is set to 1 at the same time the RNG_CR is written
	 */
	cur_nist_cfg = stm32_reg_read_bits(&rng->CR,
					   (RNG_CR_NISTC | RNG_CR_CLKDIV | RNG_CR_RNG_CONFIG1 |
					    RNG_CR_RNG_CONFIG2 | RNG_CR_RNG_CONFIG3
#if defined(RNG_CR_ARDIS)
				| RNG_CR_ARDIS
	/* For STM32U5 series, the ARDIS bit7 is considered in the nist-config */
#endif /* RNG_CR_ARDIS */
			));
#endif /* nist_config */

