zephyrproject-rtos/zephyr/drivers/entropy/entropy_stm32.c
#if DT_INST_NODE_HAS_PROP(0, health_test_config)
	cur_htcr = LL_RNG_GetHealthConfig(rng);
#endif /* health_test_config */

#if DT_INST_NODE_HAS_PROP(0, noise_source_control)
	cur_nscr = stm32_reg_read(&rng->NSCR);
#endif /* noise_source_control */

	if (cur_nist_cfg != desired_nist_cfg || cur_htcr != desired_htcr ||
	    cur_nscr != desired_nscr) {
		stm32_reg_modify_bits(&rng->CR, cur_nist_cfg, desired_nist_cfg | RNG_CR_CONDRST);

#if DT_INST_NODE_HAS_PROP(0, health_test_config)
#if DT_INST_NODE_HAS_PROP(0, health_test_magic)
		/* On certain series, a magic value must be written first as
		 * health configuration before the actual configuration value.
		 */
		LL_RNG_SetHealthConfig(rng, DT_INST_PROP(0, health_test_magic));
#endif /* health_test_magic */
		LL_RNG_SetHealthConfig(rng, desired_htcr);
#endif /* health_test_config */

#if DT_INST_NODE_HAS_PROP(0, noise_source_control)
		stm32_reg_write(&rng->NSCR, DT_INST_PROP(0, noise_source_control));
#endif /* noise_source_control */

		LL_RNG_DisableCondReset(rng);
		/* Wait for conditioning reset process to be completed */
		while (LL_RNG_IsEnabledCondReset(rng) == 1) {
		}
	}
#endif /* STM32_CONDRST_SUPPORT */
}

/* This function releases the HSEM (on applicable series) for RNG access */
static void release_rng(void)
{
	const struct device *dev = DEVICE_DT_GET(DT_DRV_INST(0));
	const struct entropy_stm32_rng_dev_cfg *dev_cfg = dev->config;
	RNG_TypeDef *rng = dev_cfg->rng;
	uint32_t old_use_count;
	k_spinlock_key_t key;
	int res = 0;

	ASSERT_RNG_HSEM_OWNED();

	key = k_spin_lock(&entropy_stm32_rng_data.uc_lock);
	old_use_count = entropy_stm32_rng_data.use_count;
	entropy_stm32_rng_data.use_count--;

	if (old_use_count != 1) {
		/* We're not the last; keep HSEM held and RNG enabled. */
		k_spin_unlock(&entropy_stm32_rng_data.uc_lock, key);
		return;
	}

	LL_RNG_Disable(rng);
#if defined(CONFIG_SOC_STM32WB09XX)
	/* RM0505 Rev.2 §14.4:
	 * "After the TRNG IP is disabled by setting CR.DISABLE, in order to
	 * properly restart the TRNG IP, the AES_RESET bit must be set to 1
	 * (that is, resetting the AES core and restarting all health tests)."
	 */
	LL_RNG_SetAesReset(rng, 1);
#endif /* CONFIG_SOC_STM32WB09XX */

/*
 * The PKA IP is currently not supported by Zephyr but may be used by
 * external code, such as wireless stack for example. Since the RNG
 * clock must be enabled when PKA is used on certain series, check if
 * the PKA is in use and keep RNG clock active if so.
 *
 * A notable exception is the STM32WB0 series where PKA can operate
 * autonomously and, on certain SoCs, lacks PKA_CR.EN and corresponding
 * LL_PKA_IsEnabled(). Since RNG clock is not required by PKA, we can
 * ignore the check on this series.
 */
#if defined(PKA) && !defined(CONFIG_SOC_SERIES_STM32WB0X)
#if defined(CONFIG_STM32_HAL2)
	uint32_t pka_clock_enabled = HAL_RCC_PKA_IsEnabledClock();
#else /* CONFIG_STM32_HAL2 */
	uint32_t pka_clock_enabled = __HAL_RCC_PKA_IS_CLK_ENABLED();
#endif /* CONFIG_STM32_HAL2 */

	if (pka_clock_enabled && LL_PKA_IsEnabled(PKA)) {
		/* PKA needs RNG clock, so exit here if in use */
		goto done;
	}
#endif /* PKA && !CONFIG_SOC_SERIES_STM32WB0X */

#ifdef CONFIG_SOC_SERIES_STM32WBAX
	uint32_t wait_cycles, rng_rate;

	res = clock_control_get_rate(dev_cfg->clock,
			(clock_control_subsys_t) &dev_cfg->pclken[0],
			&rng_rate);
	if (res == 0) {
		wait_cycles = SystemCoreClock / rng_rate * 2;

		for (int i = wait_cycles; i >= 0; i--) {
		}
	}

	/* STM32WBAX contrainsts prevent to disable the clock unless a few
	 * cycles were spent hence clock disabling below depends on @c res
	 * value.
	 */
#endif /* CONFIG_SOC_SERIES_STM32WBAX */

	if (res == 0) {
		/* Disabling the RNG clock is not expected to fail */
		res = clock_control_off(dev_cfg->clock,
					(clock_control_subsys_t)&dev_cfg->pclken[0]);
		__ASSERT_NO_MSG(res == 0);
	}

done: __maybe_unused
	entropy_stm32_hsem_release();
	k_spin_unlock(&entropy_stm32_rng_data.uc_lock, key);
}

/* This function acquires the HSEM (on applicable series) for RNG access */
static void acquire_rng(void)
{
	const struct device *dev = DEVICE_DT_GET(DT_DRV_INST(0));
	const struct entropy_stm32_rng_dev_cfg *dev_cfg = dev->config;
	RNG_TypeDef *rng = dev_cfg->rng;
	__maybe_unused int res;
	uint32_t old_use_count;
	k_spinlock_key_t key;

	key = k_spin_lock(&entropy_stm32_rng_data.uc_lock);
	old_use_count = entropy_stm32_rng_data.use_count;
	entropy_stm32_rng_data.use_count++;

	if (old_use_count == 0) {
		ASSERT_RNG_HSEM_NOT_OWNED();

		entropy_stm32_hsem_acquire();

		/* Enabling the RNG clock is not expected to fail */
		res = clock_control_on(dev_cfg->clock, (clock_control_subsys_t)&dev_cfg->pclken[0]);
		__ASSERT_NO_MSG(res == 0);

#if defined(CONFIG_SOC_STM32WB09XX)
		/**
		 * STM32WB09 RNG clock domain runs at (16 MHz / CLKDIV).
		 * CLKDIV is 256 after reset which makes the RNG runs VERY slow.
		 * Configure CLKDIV=1 to ensure RNG runs at an acceptable speed.
		 */
		LL_RNG_SetSamplingClockEnableDivider(rng, 0);
#endif
#if HAS_MULTICORE_SHARED_RNG
		/* RNG configuration could have been changed by the other core */
		configure_rng();
#endif /* HAS_MULTICORE_SHARED_RNG */

		LL_RNG_Enable(rng);
		ll_rng_enable_it(rng);
	} else {
		/*
		 * If use count is non-zero, we should be holders
		 * of the RNG HSEM and the TRNG should be enabled.
		 */
		ASSERT_RNG_HSEM_OWNED();
		__ASSERT(LL_RNG_IsEnabled(rng), "RNG should be enabled");
	}

	k_spin_unlock(&entropy_stm32_rng_data.uc_lock, key);
}

static int entropy_stm32_got_error(RNG_TypeDef *rng)
{
	__ASSERT_NO_MSG(rng != NULL);

#if defined(STM32_CONDRST_SUPPORT)
	if (LL_RNG_IsActiveFlag_CECS(rng)) {
		return 1;
	}
#endif

	if (ll_rng_is_active_seis(rng)) {
		return 1;
	}

	return 0;
}

#if defined(STM32_CONDRST_SUPPORT)
/* SOCS w/ soft-reset support: execute the reset */
static int recover_seed_error(RNG_TypeDef *rng)
{
	uint32_t count_timeout = 0;

	LL_RNG_EnableCondReset(rng);
	LL_RNG_DisableCondReset(rng);

	/* When reset process is done cond reset bit is read 0
	 * This typically takes: 2 AHB clock cycles + 2 RNG clock cycles.
	 */

	while (LL_RNG_IsEnabledCondReset(rng) ||
		ll_rng_is_active_seis(rng) ||
		ll_rng_is_active_secs(rng)) {
		count_timeout++;
		if (count_timeout == 10) {
			return -ETIMEDOUT;
		}
	}

