zephyrproject-rtos/zephyr/drivers/entropy/entropy_stm32.c
	return 0;
}

#else /* !STM32_CONDRST_SUPPORT */
/* SOCS w/o soft-reset support: flush pipeline */
static int recover_seed_error(RNG_TypeDef *rng)
{
	ll_rng_clear_seis(rng);

#if !defined(CONFIG_SOC_SERIES_STM32WB0X)
	/* After a noise source error is detected, 12 words must be read from the RNG_DR register
	 * and discarded to restart the entropy generation.
	 */
	for (int i = 0; i < 12; ++i) {
		(void)ll_rng_read_rand_data(rng);
	}
#endif /* !CONFIG_SOC_SERIES_STM32WB0X */

#if defined(CONFIG_SOC_STM32WB09XX)
	if (ll_rng_is_active_seis(rng) != 0) {
		/* RM0505 §14.7.11 "Health Test Control Register (TRNG_HEALTH_CR)":
		 * When some oscillators are powered down, the cutoff values
		 * must be increased as health tests could trigger an error.
		 * The values 100 and 850 are arbitrarily higher than the default ones.
		 * It is recommended to disable TRNG before changing these values.
		 */
		LL_RNG_Disable(rng);
		ll_rng_clear_seis(rng);
		LL_RNG_SetAesReset(rng, 1);
		if (LL_RNG_IsActiveFlag_OSCS_REPET_ERROR(rng)) {
			LL_RNG_SetRepetCutoff(rng, 100);
		}
		if (LL_RNG_IsActiveFlag_OSCS_ADAPT_ERROR(rng)) {
			LL_RNG_SetAdapCutoff(rng, 850);
		}
		LL_RNG_Enable(rng);
	}
#endif /* CONFIG_SOC_STM32WB09XX */

	if (ll_rng_is_active_seis(rng) != 0) {
		return -EIO;
	}

	return 0;
}
#endif /* !STM32_CONDRST_SUPPORT */

static int random_sample_get(rng_sample_t *rnd_sample)
{
	int retval = -EAGAIN;
	unsigned int key;
	RNG_TypeDef *rng = TRNG_BASE;

	key = irq_lock();

#if defined(CONFIG_ENTROPY_STM32_CLK_CHECK)
	if (!k_is_pre_kernel()) {
		/* CECS bit signals that a clock configuration issue is detected,
		 * which may lead to generation of non truly random data.
		 */
		__ASSERT(LL_RNG_IsActiveFlag_CECS(rng) == 0,
			 "CECS = 1: RNG domain clock is too slow.\n"
			 "\tSee ref man and update target clock configuration.");
	}
#endif /* CONFIG_ENTROPY_STM32_CLK_CHECK */

	if (ll_rng_is_active_seis(rng) && (recover_seed_error(rng) < 0)) {
		retval = -EIO;
		goto out;
	}

	if (ll_rng_is_active_drdy(rng) == 1) {
		if (entropy_stm32_got_error(rng)) {
			retval = -EIO;
			goto out;
		}

		*rnd_sample = ll_rng_read_rand_data(rng);
		if (*rnd_sample == 0) {
			/* A seed error could have occurred between RNG_SR
			 * polling and RND_DR output reading.
			 */
			retval = -EAGAIN;
			goto out;
		}

		retval = 0;
	}

out:

	irq_unlock(key);

	return retval;
}

static uint16_t generate_from_isr(uint8_t *buf, uint16_t len)
{
	uint16_t remaining_len = len;
	rng_sample_t rnd_sample;
	int ret;

#if !IRQLESS_TRNG
	__ASSERT_NO_MSG(!irq_is_enabled(IRQN));
#endif /* !IRQLESS_TRNG */

	ASSERT_RNG_HSEM_OWNED();

	/* do not proceed if a Seed error occurred */
	if (ll_rng_is_active_secs(TRNG_BASE) ||
		ll_rng_is_active_seis(TRNG_BASE)) {

		(void)random_sample_get(&rnd_sample); /* this will recover the error */

		return 0; /* return cnt is null : no random data available */
	}

#if !IRQLESS_TRNG
	/* Clear NVIC pending bit. This ensures that a subsequent
	 * RNG event will set the Cortex-M single-bit event register
	 * to 1 (the bit is set when NVIC pending IRQ status is
	 * changed from 0 to 1)
	 */
	k_irq_clear_pending(IRQN);
#endif /* !IRQLESS_TRNG */

	do {
		while (ll_rng_is_active_drdy(TRNG_BASE) != 1) {

#if !defined(CONFIG_PM_S2RAM)
#if !IRQLESS_TRNG
			/*
			 * Enter low-power mode while waiting for event
			 * generated by TRNG interrupt becoming pending.
			 *
			 * To guarantee waking up from the event, the
			 * SEV-On-Pend feature must be enabled (enabled
			 * during ARCH initialization).
			 *
			 * DSB is recommended by spec before WFE (to
			 * guarantee completion of memory transactions)
			 */
			barrier_dsync_fence_full();
			__WFE();
			__SEV();
			__WFE();
#endif /* !IRQLESS_TRNG */
#endif /* !CONFIG_PM_S2RAM */
		}

		ret = random_sample_get(&rnd_sample);
#if !IRQLESS_TRNG
		k_irq_clear_pending(IRQN);
#endif /* !IRQLESS_TRNG */

		if (ret < 0) {
			continue;
		}

		/* push each byte of the RNG sample in buffer */
		size_t i = sizeof(rnd_sample);

		while (remaining_len && i) {
			buf[--remaining_len] = (uint8_t)(rnd_sample & 0xFFu);
			rnd_sample >>= 8;
			i--;
		}
	} while (remaining_len);

	return len;
}

static int start_pool_filling(bool wait)
{
	bool already_filling;

	if (!wait) {
		if (entropy_stm32_hsem_try_acquire() != 0) {
			/* In non-blocking mode, return immediately if the RNG is not available */
			return -EAGAIN;
		}
		entropy_stm32_hsem_release();
	}

	already_filling = atomic_set(&entropy_stm32_rng_data.filling_pools, 1) != 0;

	if (unlikely(already_filling)) {
		return 0;
	}

	acquire_rng();
#if IRQLESS_TRNG
	k_work_schedule_for_queue(entropy_stm32_rng_data.filling_wq,
				  &entropy_stm32_rng_data.trng_poll_work,
				  TRNG_GENERATION_DELAY);
#else /* !IRQLESS_TRNG */
	irq_enable(IRQN);
#endif /* IRQLESS_TRNG */
	return 0;
}

static void pool_filling_work_handler(struct k_work *work)
{
	if (start_pool_filling(false) != 0) {
		/* RNG could not be acquired, try again */
		k_work_submit_to_queue(entropy_stm32_rng_data.filling_wq, work);
	}
}

static void pool_refill_requested(void)
{
	struct entropy_stm32_rng_dev_data *dev_data = &entropy_stm32_rng_data;
	unsigned int key = irq_lock();

	if (atomic_set(&dev_data->pm_locked, 1) == 0) {
		/* Prevent the clocks to be stopped during the duration the rng pool is
		 * being populated. The ISR will release the constraint again when the
		 * rng pool is filled. This also ensures the pools are filled enough
		 * at wakeup where an ISR may request some.
		 */
		pm_policy_state_lock_get(PM_STATE_SUSPEND_TO_IDLE, PM_ALL_SUBSTATES);
		if (IS_ENABLED(CONFIG_PM_S2RAM)) {
			pm_policy_state_lock_get(PM_STATE_SUSPEND_TO_RAM, PM_ALL_SUBSTATES);
		}
	}

	irq_unlock(key);
}

static void pool_refill_completed(void)
{
	struct entropy_stm32_rng_dev_data *dev_data = &entropy_stm32_rng_data;
	unsigned int key = irq_lock();

	if (atomic_set(&dev_data->pm_locked, 0) != 0) {
		pm_policy_state_lock_put(PM_STATE_SUSPEND_TO_IDLE, PM_ALL_SUBSTATES);
		if (IS_ENABLED(CONFIG_PM_S2RAM)) {
			pm_policy_state_lock_put(PM_STATE_SUSPEND_TO_RAM, PM_ALL_SUBSTATES);
		}
	}

	atomic_set(&dev_data->filling_pools, 0);

	irq_unlock(key);
}

static uint16_t rng_pool_get(struct rng_pool *rngp, uint8_t *buf,
	uint16_t len)
{
	uint32_t last  = rngp->last;
	uint32_t mask  = rngp->mask;
	uint8_t *dst   = buf;
	uint32_t first, available;
	uint32_t other_read_in_progress;
	unsigned int key;

