zephyrproject-rtos/zephyr/drivers/entropy/entropy_stm32.c
	key = irq_lock();
	first = rngp->first_alloc;

	/*
	 * The other_read_in_progress is non-zero if rngp->first_read != first,
	 * which means that lower-priority code (which was interrupted by this
	 * call) already allocated area for read.
	 */
	other_read_in_progress = (rngp->first_read ^ first);

	available = (last - first) & mask;
	if (available < len) {
		len = available;
	}

	/*
	 * Move alloc index forward to signal, that part of the buffer is
	 * now reserved for this call.
	 */
	rngp->first_alloc = (first + len) & mask;
	irq_unlock(key);

	while (likely(len--)) {
		*dst++ = rngp->buffer[first];
		first = (first + 1) & mask;
	}

	/*
	 * If this call is the last one accessing the pool, move read index
	 * to signal that all allocated regions are now read and could be
	 * overwritten.
	 */
	if (likely(!other_read_in_progress)) {
		key = irq_lock();
		rngp->first_read = rngp->first_alloc;
		irq_unlock(key);
	}

	len = dst - buf;
	available = available - len;
	if (available <= rngp->threshold) {
		pool_refill_requested();

		/*
		 * Avoid starting pool filling from ISR as it might require
		 * blocking if RNG is not available and a race condition could
		 * also occur if this ISR has interrupted the RNG ISR.
		 *
		 * If the TRNG has no IRQ line, always schedule the work item,
		 * as this is what fills the RNG pools instead of the ISR.
		 */
		if (k_is_in_isr() || IRQLESS_TRNG) {
			k_work_submit_to_queue(entropy_stm32_rng_data.filling_wq,
					       &entropy_stm32_rng_data.filling_work);
		} else {
			start_pool_filling(true);
		}
	}

	return len;
}

static int rng_pool_put(struct rng_pool *rngp, uint8_t byte)
{
	uint8_t first = rngp->first_read;
	uint8_t last  = rngp->last;
	uint8_t mask  = rngp->mask;

	/* Signal error if the pool is full. */
	if (((last - first) & mask) == mask) {
		return -ENOBUFS;
	}

	rngp->buffer[last] = byte;
	rngp->last = (last + 1) & mask;

	return 0;
}

static void rng_pool_init(struct rng_pool *rngp, uint16_t size,
			uint8_t threshold)
{
	rngp->first_alloc = 0U;
	rngp->first_read  = 0U;
	rngp->last	  = 0U;
	rngp->mask	  = size - 1;
	rngp->threshold	  = threshold;
}

static int perform_pool_refill(void)
{
	rng_sample_t rnd_sample;
	bool refilled_thr = false;
	int ret;

	ret = random_sample_get(&rnd_sample);
	if (ret < 0) {
		return ret;
	}

	/* push each byte of the RNG sample in pools */
	for (size_t i = 0; i < sizeof(rnd_sample); i++, rnd_sample >>= 8) {
		uint8_t byte = rnd_sample & 0xFFu;

		ret = rng_pool_put((struct rng_pool *)(entropy_stm32_rng_data.isr), byte);
		if (ret < 0) {
			/* Take note that data has been added to thread pool */
			refilled_thr = true;

			ret = rng_pool_put((struct rng_pool *)(entropy_stm32_rng_data.thr), byte);
			if (ret < 0) {
#if !IRQLESS_TRNG
				irq_disable(IRQN);
#endif /* !IRQLESS_TRNG */
				release_rng();
				pool_refill_completed();
				break;
			}
		}
	}

	if (refilled_thr) {
		/**
		 * Wake up threads that may be waiting for new data to be
		 * available in thread pool if we added entropy in it.
		 */
		k_sem_give(&entropy_stm32_rng_data.sem_sync);
	}

	return ret;
}

#if IRQLESS_TRNG
static void trng_poll_work_item(struct k_work *work)
{
	struct k_work_delayable *dwork = k_work_delayable_from_work(work);
	RNG_TypeDef *rng = TRNG_BASE;

	/* Seed error occurred: reset TRNG and try again */
	if (ll_rng_is_active_secs(TRNG_BASE) ||
		ll_rng_is_active_seis(TRNG_BASE)) {

		rng_sample_t dummy;
		(void)random_sample_get(&dummy); /* this will recover the error */
	} else if (ll_rng_is_active_drdy(rng)) {
		/* Entropy available: read it and fill pools */
		int res = perform_pool_refill();

		if (res == -ENOBUFS) {
			/**
			 * All RNG pools are full - no more work needed.
			 * Exit early to stop the work item from re-scheduling
			 * itself. The RNG peripheral has already been released
			 * by perform_pool_refill().
			 */
			return;
		}
	} else {
		/**
		 * No entropy available - try again later
		 */
	}

	/* Schedule ourselves for next cycle */
	k_work_schedule(dwork, TRNG_GENERATION_DELAY);
}
#else /* !IRQLESS_TRNG */
static void stm32_rng_isr(const void *arg)
{
	ARG_UNUSED(arg);

	(void)perform_pool_refill();
}
#endif /* IRQLESS_TRNG */

static int entropy_stm32_rng_get_entropy(const struct device *dev,
					 uint8_t *buf,
					 uint16_t len)
{
	while (len) {
		uint16_t bytes;

		k_sem_take(&entropy_stm32_rng_data.sem_lock, K_FOREVER);
		bytes = rng_pool_get(
				(struct rng_pool *)(entropy_stm32_rng_data.thr),
				buf, len);

		if (bytes == 0U) {
			/* Pool is empty: Sleep until next interrupt. */
			k_sem_take(&entropy_stm32_rng_data.sem_sync, K_FOREVER);
		}

		k_sem_give(&entropy_stm32_rng_data.sem_lock);

		len -= bytes;
		buf += bytes;
	}

	return 0;
}

static int entropy_stm32_rng_get_entropy_isr(const struct device *dev,
					     uint8_t *buf,
					     uint16_t len,
					     uint32_t flags)
{
	uint16_t cnt = len;

	if (likely((flags & ENTROPY_BUSYWAIT) == 0U)) {
		return rng_pool_get(
				(struct rng_pool *)(entropy_stm32_rng_data.isr),
				buf, len);
	}

	if (len) {
#if !IRQLESS_TRNG
		/**
		 * Disable RNG interrupt at NVIC level to ensure this driver's ISR
		 * cannot preempt us: it would steal random bits our caller wants
		 * as soon as possible!
		 *
		 * It's unnecessary to disable interrupts while doing this because
		 * modifying NVIC configuration itself is atomic:
		 * - if we get preempted after irq_disable() completes, higher
		 *   priority ISRs will see the interrupt is already disabled and
		 *   leave the re-enabling duty to us, which we will do
		 *
		 * - if we get preempted before irq_disable(), higher priority ISRs
		 *   will disable the IRQ themselves and re-enable it when done;
		 *   slightly wasteful, but does not cause issues since we will
		 *   eventually manage to irq_disable() after regaining control.
		 */
		int rng_irq_enabled = irq_is_enabled(IRQN);

		irq_disable(IRQN);
#endif /* !IRQLESS_TRNG */

		/*
		 * Ensure the RNG is enabled then poll for entropy.
		 * We don't need to mask interrupts while polling
		 * because re-entrant calls will merely increment
		 * the RNG's use count temporarily, but can never
		 * make it reach zero since any ISR which completes
		 * acquire_rng() owns a reference, and any ISR which
		 * doesn't will eventually call it.
		 */
		acquire_rng();
		cnt = generate_from_isr(buf, len);
		release_rng();

#if !IRQLESS_TRNG
		/* Re-enable RNG interrupt at NVIC level if applicable */
		if (rng_irq_enabled) {
			irq_enable(IRQN);
		}
#endif /* !IRQLESS_TRNG */
	}

	return cnt;
}

static int entropy_stm32_init_hw_rng(const struct entropy_stm32_rng_dev_cfg *dev_cfg,
				     struct entropy_stm32_rng_dev_data *dev_data)
{
	int res;

	res = clock_control_on(dev_cfg->clock,
		(clock_control_subsys_t)&dev_cfg->pclken[0]);
	if (res != 0) {
		LOG_ERR("Failed to enable RNG bus clock (err %d). "
			"Check clock configuration in DTS.", res);
		return res;
	}

