zephyrproject-rtos/zephyr/drivers/entropy/entropy_stm32.c
	/* Configure domain clock if any */
	if (DT_INST_NUM_CLOCKS(0) > 1) {
		res = clock_control_configure(dev_cfg->clock,
					      (clock_control_subsys_t)&dev_cfg->pclken[1],
					      NULL);
		if (res != 0) {
			LOG_ERR("Failed to configure RNG kernel clock (err %d). "
				"Verify domain clock (e.g. HSI48) is enabled in DTS.", res);
			return res;
		}
	}

#if !HAS_MULTICORE_SHARED_RNG
	/* For multi-core MCUs, RNG configuration is automatically performed
	 * after acquiring the RNG in start_pool_filling()
	 */
	configure_rng();
#endif /* !HAS_MULTICORE_SHARED_RNG */

	return 0;
}

static int entropy_stm32_init_wq(void)
{
	struct entropy_stm32_rng_dev_data *dev_data = &entropy_stm32_rng_data;

#ifdef CONFIG_ENTROPY_STM32_WORKQUEUE
	k_work_queue_init(&entropy_stm32_wq);
	k_work_queue_start(&entropy_stm32_wq, (k_thread_stack_t *)&entropy_stm32_wq_stack,
			   K_THREAD_STACK_SIZEOF(entropy_stm32_wq_stack),
			   CONFIG_ENTROPY_STM32_WQ_PRIO, NULL);
	k_thread_name_set(entropy_stm32_wq.thread_id, "stm32-rng-pool-filling");
	dev_data->filling_wq = &entropy_stm32_wq;
#else
	dev_data->filling_wq = &k_sys_work_q;
#endif /* CONFIG_ENTROPY_STM32_WORKQUEUE */

	pool_refill_requested();
	start_pool_filling(true);

	return 0;
}

#if !IRQLESS_TRNG
SYS_INIT(entropy_stm32_init_wq, POST_KERNEL, CONFIG_KERNEL_INIT_PRIORITY_DEFAULT);
#endif /* !IRQLESS_TRNG */

static int entropy_stm32_init(const struct device *dev)
{
	const struct entropy_stm32_rng_dev_cfg *dev_cfg = dev->config;
	struct entropy_stm32_rng_dev_data *dev_data = dev->data;
	int res;

	/* Locking semaphore initialized to 1 (unlocked) */
	k_sem_init(&dev_data->sem_lock, 1, 1);

	/* Syncing semaphore */
	k_sem_init(&dev_data->sem_sync, 0, 1);

	k_work_init(&dev_data->filling_work, pool_filling_work_handler);

#if IRQLESS_TRNG
	k_work_init_delayable(&dev_data->trng_poll_work, trng_poll_work_item);
#endif /* IRQLESS_TRNG */

	rng_pool_init((struct rng_pool *)(dev_data->thr),
		      CONFIG_ENTROPY_STM32_THR_POOL_SIZE,
		      CONFIG_ENTROPY_STM32_THR_THRESHOLD);
	rng_pool_init((struct rng_pool *)(dev_data->isr),
		      CONFIG_ENTROPY_STM32_ISR_POOL_SIZE,
		      CONFIG_ENTROPY_STM32_ISR_THRESHOLD);

#if !IRQLESS_TRNG
	IRQ_CONNECT(IRQN, IRQ_PRIO, stm32_rng_isr, &entropy_stm32_rng_data, 0);
#endif /* !IRQLESS_TRNG */

	entropy_stm32_hsem_acquire();

	res = entropy_stm32_init_hw_rng(dev_cfg, dev_data);
	if (res < 0) {
		goto out;
	}

	if (DT_INST_NUM_CLOCKS(0) > 1) {
		uint32_t rng_clock_rate;

		if (clock_control_get_rate(dev_cfg->clock,
					   (clock_control_subsys_t)&dev_cfg->pclken[1],
					   &rng_clock_rate) != 0) {
			LOG_ERR("Failed to get RNG domain clock rate");
			res = -EIO;
			goto out;
		}

		if (rng_clock_rate == 0) {
			LOG_ERR("RNG domain clock is not running (null rate)");
			res = -ENOTSUP;
			goto out;
		}
	}

	if (IRQLESS_TRNG) {
		entropy_stm32_init_wq();
	}

out:
	entropy_stm32_hsem_release();

	return res;
}

#ifdef CONFIG_PM_DEVICE
static int entropy_stm32_rng_pm_action(const struct device *dev,
				       enum pm_device_action action)
{
	int res = 0;

	switch (action) {
	case PM_DEVICE_ACTION_SUSPEND:
		break;
	case PM_DEVICE_ACTION_RESUME:
		if (IS_ENABLED(CONFIG_PM_S2RAM)) {
			const struct entropy_stm32_rng_dev_cfg *dev_cfg = dev->config;
			struct entropy_stm32_rng_dev_data *dev_data = dev->data;

			ASSERT_RNG_HSEM_NOT_OWNED();
			entropy_stm32_hsem_acquire();

			res = entropy_stm32_init_hw_rng(dev_cfg, dev_data);
			if (res < 0) {
				LOG_ERR("Failed to re-init STM32 RNG: %d", res);
			}

			entropy_stm32_hsem_release();
		}
		break;
	default:
		return -ENOTSUP;
	}

	return res;
}
#endif /* CONFIG_PM_DEVICE */

static DEVICE_API(entropy, entropy_stm32_rng_api) = {
	.get_entropy = entropy_stm32_rng_get_entropy,
	.get_entropy_isr = entropy_stm32_rng_get_entropy_isr
};

PM_DEVICE_DT_INST_DEFINE(0, entropy_stm32_rng_pm_action);

DEVICE_DT_INST_DEFINE(0,
		    entropy_stm32_init, PM_DEVICE_DT_INST_GET(0),
		    &entropy_stm32_rng_data, &entropy_stm32_rng_config,
		    STM32_TRNG_INIT_LEVEL, CONFIG_ENTROPY_INIT_PRIORITY,
		    &entropy_stm32_rng_api);
